In [2]:
import pandas as pd
df = pd.read_csv("Homicidio.csv")

/var/folders/yg/61yprmg537j5542lhzvmzz8w0000gn/T/ipykernel_44246/1515473921.py:2: DtypeWarning: Columns (16) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Homicidio.csv")

In [3]:
df.loc[0,:]

Record ID                                            1
Agency Code                                    AK00101
Agency Name                                  Anchorage
Agency Type                           Municipal Police
City                                         Anchorage
State                                           Alaska
Year                                              1980
Month                                          January
Incident                                             1
Crime Type                      Murder or Manslaughter
Crime Solved                                       Yes
Victim Sex                                        Male
Victim Age                                          14
Victim Race              Native American/Alaska Native
Victim Ethnicity                               Unknown
Perpetrator Sex                                   Male
Perpetrator Age                                     15
Perpetrator Race         Native American/Alaska Native
Perpetrator Ethnicity                          Unknown
Relationship                              Acquaintance
Weapon                                    Blunt Object
Victim Count                                         0
Perpetrator Count                                    0
Record Source                                      FBI
Name: 0, dtype: object

In [3]:
df["Crime Type"].unique()

array(['Murder or Manslaughter', 'Manslaughter by Negligence'],
      dtype=object)

In [4]:
df.query("Year>1995 & Year<=2000").groupby("City").agg({"Incident":"sum"}).reset_index().sort_values("Incident", ascending=False).head(10)

                      City  Incident
926               New York    135064
318                   Cook    113853
774            Los Angeles     78060
393   District of Columbia     47615
1411                 Wayne     43821
997             Palm Beach     43559
973                 Orange     35869
595           Hillsborough     31318
1030          Philadelphia     31272
1039              Pinellas     24349

In [5]:
df.query("Year>1995 & Year<2000").groupby(["Crime Type","City"]).agg({"Incident":"sum"}).reset_index().sort_values("Incident", ascending=False).head(10)

                  Crime Type                  City  Incident
1255  Murder or Manslaughter              New York    114075
674   Murder or Manslaughter                  Cook     93927
1109  Murder or Manslaughter           Los Angeles     62444
747   Murder or Manslaughter  District of Columbia     47615
1718  Murder or Manslaughter                 Wayne     36069
1351  Murder or Manslaughter          Philadelphia     26288
438   Murder or Manslaughter        Baltimore city     17271
914   Murder or Manslaughter                Harris     13604
1301  Murder or Manslaughter               Orleans     12526
713   Murder or Manslaughter                Dallas      9525

In [6]:
df.query("Year>=1995 & Year<=2000").groupby(["State"]).agg({"Incident":"sum"}).reset_index().sort_values("Incident", ascending=False).head(10)

                   State  Incident
9                Florida    342238
32              New York    203120
13              Illinois    142428
4             California    135554
22              Michigan     57253
8   District of Columbia     53934
43                 Texas     48333
38          Pennsylvania     42264
20              Maryland     30125
18             Louisiana     24465

In [7]:
df.query("Year>=1995 & Year<=2000 & City == 'New York'").Incident.sum()

199957

In [8]:
df.query("Year>=1995 & Year<=2000 & City == 'New York'").Incident.count()

5109

In [9]:
df.State.unique()

array(['Alaska', 'Alabama', 'Arkansas', 'Arizona', 'California',
       'Colorado', 'Connecticut', 'District of Columbia', 'Delaware',
       'Florida', 'Georgia', 'Hawaii', 'Iowa', 'Idaho', 'Illinois',
       'Indiana', 'Kansas', 'Kentucky', 'Louisiana', 'Massachusetts',
       'Maryland', 'Maine', 'Michigan', 'Minnesota', 'Missouri',
       'Mississippi', 'Montana', 'Nebraska', 'North Carolina',
       'North Dakota', 'New Hampshire', 'New Jersey', 'New Mexico',
       'Nevada', 'New York', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhodes Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Virginia', 'Vermont', 'Washington', 'Wisconsin',
       'West Virginia', 'Wyoming'], dtype=object)

In [10]:
df.query("Year>=1995 & Year<=2000 & City == 'New York'")["Victim Count"].sum()

400

In [11]:
df.query("Year>=1995 & Year<=2000 ").groupby(["City"]).agg({"Victim Count":"count"}).reset_index().sort_values("Victim Count", ascending=False).head(10)

                City  Victim Count
794      Los Angeles          7453
949         New York          5109
328             Cook          4438
1444           Wayne          3110
1056    Philadelphia          2324
586           Harris          2183
75    Baltimore city          1812
828         Maricopa          1728
367           Dallas          1726
1001         Orleans          1623

In [12]:
df.query("Year>=1995 & Year<=2000 ").groupby(["City"]).agg({"Victim Count":"sum"}).reset_index().sort_values("Victim Count", ascending=False).head(10)

              City  Victim Count
987       Oklahoma          1542
794    Los Angeles           906
949       New York           400
1056  Philadelphia           344
1444         Wayne           318
328           Cook           260
828       Maricopa           252
586         Harris           250
670      Jefferson           238
367         Dallas           218

In [13]:
df.query("Year>=1995 & Year<=2000 & City == 'New York'").groupby(["Weapon"]).agg({"Incident":"sum"})

              Incident
Weapon
Blunt Object     24940
Explosives          33
Fire              3008
Gun                 26
Handgun         128190
Knife            31053
Poison             119
Rifle             1032
Shotgun           3048
Unknown           8508

In [14]:
rp = df["Perpetrator Race"].value_counts().head(1)
print('Total', rp.values[0])

Total 218243